In [32]:
people = {
    'first': ['Vikram','karan','Rahul'],
    'last' : ['Kumar','Parsan','Roy'],
    'email': ['VikraMKumar@gmail.com','KaranPrasan@email.com','RahuLRoy@email.com']
}

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame(people)

In [35]:
df

    first    last                  email
0  Vikram   Kumar  VikraMKumar@gmail.com
1   karan  Parsan  KaranPrasan@email.com
2   Rahul     Roy     RahuLRoy@email.com

In [36]:
df['first'] + " " + df["last"]

0    Vikram Kumar
1    karan Parsan
2       Rahul Roy
dtype: object

In [37]:
df['full_name'] = df['first'] + " " + df["last"]

In [38]:
df

    first    last                  email     full_name
0  Vikram   Kumar  VikraMKumar@gmail.com  Vikram Kumar
1   karan  Parsan  KaranPrasan@email.com  karan Parsan
2   Rahul     Roy     RahuLRoy@email.com     Rahul Roy

In [39]:
df.drop(columns = ['first','last'],inplace=True)
df

                   email     full_name
0  VikraMKumar@gmail.com  Vikram Kumar
1  KaranPrasan@email.com  karan Parsan
2     RahuLRoy@email.com     Rahul Roy

In [43]:
df['full_name'].str.split(" ")

0    [Vikram, Kumar]
1    [karan, Parsan]
2       [Rahul, Roy]
Name: full_name, dtype: object

In [44]:
df['full_name'].str.split(" ",expand=True)

        0       1
0  Vikram   Kumar
1   karan  Parsan
2   Rahul     Roy

In [47]:
df[['first','last']] = df['full_name'].str.split(" ",expand = True)
df

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
1  KaranPrasan@email.com  karan Parsan   karan  Parsan
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy

In [48]:
df.append({'first':'Tony'},ignore_index=True)

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
1  KaranPrasan@email.com  karan Parsan   karan  Parsan
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy
3                    NaN           NaN    Tony     NaN

In [49]:
people = {
    'first':['Tony',"Steve"],
    'last':['Stark','Rogers'],
    'email':['ironman@avenge.com','cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [50]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [54]:
df.append(df2,ignore_index=True,sort=False)

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
1  KaranPrasan@email.com  karan Parsan   karan  Parsan
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy
3     ironman@avenge.com           NaN    Tony   Stark
4         cap@avenge.com           NaN   Steve  Rogers

In [58]:
df3=df.append(df2,ignore_index=True,sort=False)
df3

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
1  KaranPrasan@email.com  karan Parsan   karan  Parsan
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy
3     ironman@avenge.com           NaN    Tony   Stark
4         cap@avenge.com           NaN   Steve  Rogers

In [67]:
df3.drop(index=4)

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
1  KaranPrasan@email.com  karan Parsan   karan  Parsan
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy
3     ironman@avenge.com           NaN    Tony   Stark

In [76]:
df3.drop(index = df[df['last']=="Parsan"].index)

                   email     full_name   first    last
0  VikraMKumar@gmail.com  Vikram Kumar  Vikram   Kumar
2     RahuLRoy@email.com     Rahul Roy   Rahul     Roy
3     ironman@avenge.com           NaN    Tony   Stark
4         cap@avenge.com           NaN   Steve  Rogers

In [80]:
filt = df3['last'] == "Kumar"
df3.drop(index=df[filt].index)

C:\Users\Lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

                   email     full_name  first    last
1  KaranPrasan@email.com  karan Parsan  karan  Parsan
2     RahuLRoy@email.com     Rahul Roy  Rahul     Roy
3     ironman@avenge.com           NaN   Tony   Stark
4         cap@avenge.com           NaN  Steve  Rogers